<template >
    <q-header bordered class="bg-transparent text-black" height-hint="98" style="font-family: Vazir;">
        <q-toolbar style="display: flex; justify-content: space-between;">
            <h6 class="text-subtitle1 no-margin">{{ today }}</h6>
            <h3 class="text-h3 text-weight-medium text-center no-margin q-py-sm">شیراز تایمز</h3>
            <q-btn dense flat round icon="menu" @click="toggleRightDrawer" />
        </q-toolbar>

    </q-header>

    <q-drawer show-if-above v-model="rightDrawerOpen" side="right" bordered>
        <q-scroll-area class="fit">
            <q-list>

                <template v-for="(menuItem, index) in channel_name" :key="index">
                    <q-separator />
                    <q-item class="q-pa-sm" clickable :active="menuItem.label === 'Outbox'" v-ripple>

                        <q-item-section style="display: flex;align-items: center;">
                            {{ menuItem }}
                        </q-item-section>
                        <q-item-section style="display: flex;align-items: center;">
                            <q-avatar>
                                <img src="../assets/rdj.jpg">
                            </q-avatar>
                        </q-item-section>
                    </q-item>

                </template>

            </q-list>
        </q-scroll-area>
    </q-drawer>
</template>

<script>
import { ref } from 'vue'


export default {
    setup() {
        const rightDrawerOpen = ref(false)
        function join(date, options, separator) {
            function format(option) {
                let formatter = new Intl.DateTimeFormat('fa', option);
                return formatter.format(date);
            }
            return options.map(format).join(separator);
        }
        let options = [{ weekday: 'long' }, { day: 'numeric' }, { month: 'short' }, { year: 'numeric' }];
        let today = join(new Date, options, ' ');
        console.log(today);
        //sample data
        const allData = {
            "67414": {
                "channel": "ManotoTV",
                "message": "نسرین شاکرمی مادر نیکا شاکرمی در آستانه سالروز خیزش ۱۴۰۱ متنی در اینستاگرام خود منتشر کرده است که در اینجا آن را نقل می‌کنیم:\n\n‌\n\n«مردم عزیز، شریف و داغدار ایران\n\n‌\n\nسال‌هاست خرافه‌پرستان از شخصیت‌های بزرگ دینی فقط برای عزاداری و اشک مردم را درآوردن استفاده می‌کنند. در منبر کمتر از عدالت، شجاعت، ظلم‌ستیزی و شادی آن‌ها شنیدی. ما که معتقدیم بچه‌های ما علیه این مغزهای پوسیده شوریده‌اند و دنیایی زیبا و پر از شادی را مطالبه می کنند، نباید داغ و درد مصیبت‌های خود را صرفا به آه و ناله ختم کنیم. آه و ناله‌ مدام از ما انسان‌هایی ضعیف و بیمار می‌سازد که هیچ کاری از آنها ساخته نیست.\n\nحالا که به سالروز این جنبش آزادی‌بخش نزدیک می‌شویم از همه خواهش می کنم داغ و درد‌هایمان را به جای ماتم و عزا به انگیزه‌ای امید‌بخش برای ساختن ایرانی آباد و آزاد تبدیل کنیم. در این مسیر طبیعتاً به شادی و کسب و کار هم باید پرداخت تا زندگی کسی آسیب نبیند و گرنه روز به روز ما ضعیف‌‌تر خواهیم شد و کسانی که خون فرزندانمان از پنجه کثیفشان می‌چکد فربه‌تر خواهند شد.",
                "views": 34728
            },
            "67415": {
                "channel": "ManotoTV",
                "message": "حسین کوشکی‌نژاد، برادر رضا کوشکی‌نژاد، نظامی بازداشتی، روایتی از دادگاه برادرش را منتشر کرده است. \n \nاو در توضیح آنچه رضا در دادگاه بیان کرده، نوشت:«از هفده اتهام پرونده دوم، رضا تنها یکیشو پذیرفته و اونم اینه که بله من طرفدار پادشاهیم...» \n \nرضا در دادگاه با دفاع از عقاید خود گفت:«من به عملکرد خاندان پهلوی که نگاه کردم دیدم در مدت کوتاهی از چاله‌های عمیقی ایران را بیرون کشیده‌اند... \n \nچاله هایی به عمق قرن‌ها انحطاط فکری و انسانی... \n \nپهلوی عقیده من است جناب قاضی و در قانون تفتیش عقاید و دیدگاه معنی و مفهومی ندارد، اگر بارها زندانی شوم باز هم با همین دیدگاه سیاسی ادامه خواهم داد، اگر شما ایرادی بر پهلوی می‌بینید به ما هم بگویید شاید دو عملکرد متفاوت را به ما نشان داده‌اند... \n \nاختلاس کرده بود ، بچه های مردم و کف خیابون کشته بود، اعدام کرده بود، دین نداشت، ایران و فروخته بود... \n \nمن نه تنها طرفدار پادشاهی پهلویم بلکه طرفدار تمام تاریخ پادشاهی ایرانم(بغیر قاجار)سکوت حضار...پایان...» \n \nحسین در پایان پست اینستاگرامی‌اش از هشتگ «متهم اظهار پشیمانی نکرد» استفاده کرده است.",
                "views": 12979
            },
            "67416": {
                "channel": "ManotoTV",
                "message": "",
                "views": 13142
            },
            "67417": {
                "channel": "ManotoTV",
                "message": "محمدحسین آجورلو، همسر نیلوفر حامدی، در صفحات خود در فضای مجازی نسبت به اظهارات سخنگوی قوه قضاییه درباره ارائه گزارش کامل پرونده نیلوفر واکنش نشان داد. \nاو نوشت:«سخنگوی قوه قضائیه وعده داده به‌زودی درباره پرونده نیلوفر حامدی به مردم گزارش کامل داده می‌شود. امیدوارم در این گزارش به این سوالات هم پاسخ داده شود. اگر بازداشت نیلوفر حامدی به مرگ مهسا امینی ربطی نداشت، چرا دقیقا چند روز پس از این اتفاق بازداشت شد؟ چرا هم در بازجویی، هم در دادسرا و هم در دادگاه درباره این موضوع از او سوال شد؟ چرا بخشی از کیفرخواست پرونده به این موضوع اختصاص دارد؟ چرا دو نهاد امنیتی در بیانیه خود، اتهام نیلوفر را گرفتن عکس مهسا امینی روی تخت بیمارستان عنوان کردند؟ \nاز شفاف‌سازی استقبال می‌کنیم اما قوه قضائیه که حالا قصد ارائه «گزارش کامل» دارد چرا با برگزاری دادگاه علنی مخالفت کرد؟ چرا وکلای ما به استناد قرار غیرعلنی دادگاه، از بیان هرگونه جزییات منع شده‌اند و سخنگوی قوه، قول گزارش کامل می‌دهد؟ گزارش، وقتی کامل است که اجازه بدهند وکلای نیلوفر هم راجع به پرونده صحبت کنند.»",
                "views": 13514
            },
            "149657": {
                "channel": "mehrnews",
                "message": "بازداشت زنی که به مقدسات دینی توهین کرده بود\n\n🔺 دادستان تهران: طی روزهای اخیر تصویری از یک خانم در مکان عمومی که به ائمه اطهار و مقدسات دینی توهین می‌کرد در فضای مجازی پخش شد.\n\n🔺 از طریق نیابت قضائی ارسالی از سوی استان لرستان با تلاش نیروهای مجاهد فراجا این خانم در زمان کوتاهی شناسایی و ساعتی پیش بازداشت شده است. با بازداشت این خانم پرونده برای وی تشکیل و در اختیار مقام قضائی قرار گرفت.\n\n📡 @Mehrnews",
                "views": 799
            },
            "149659": {
                "channel": "mehrnews",
                "message": "📸 #کرونا | جدیدترین آمار کرونا در کشور\n\n📡 @Mehrnews",
                "views": 413
            },
            "149660": {
                "channel": "mehrnews",
                "message": "واکنش پاپ فرانسیس رهبر کاتولیکهای جهان\n\n🔺 «پاپ فرانسیس»، رهبر کاتولیک‌های جهان در پاسخ به نامه «حجت‌الاسلام والمسلمین عبدالکریم پاز» نماینده ادیان در بنیاد اسلامی آرژانتین (FIAS)، ضمن محکوم کردن هتک حرمت قرآن کریم در سوئد و دانمارک، این گونه اقدام شنیع را مانع گفتگوی انسانی دانست.\n\nدکتر عبدالکریم پاز\nبرادر عزیزم\nاز نامه شما بسیار سپاسگزارم.\n\nماجرای آتش زدن قرآن کریم واقعا یک عمل وحشیانه است. این موارد به گفت وگوی انسانی و بالغانه میان مردم آسیب می‌زند و مانع آن می‌شود.\n\nبرادرانه، فرانسیس\n\n📡 @Mehrnews",
                "views": 396
            },
            "149661": {
                "channel": "mehrnews",
                "message": "📸 مهدی فضائلی: رهبر انقلاب، جناب آقای موسوی خوئینی‌‌ها را در تاریخ ۶۸/۱۰/۱۷‌، به سمت مشاور سیاسی خود منصوب کردند و ایشان هم پذیرفتند\n\n📡 @Mehrnews",
                "views": 228
            },
            "186345": {
                "channel": "IranintlTV",
                "message": "احضار سفیر لهستان از سوی اوکراین\nجزییات بیشتر با مصدق پارسا، ایران اینترنشنال\n@iranintltv",
                "views": 8303
            },
            "186346": {
                "channel": "IranintlTV",
                "message": "محسن پیرهادی، نایب‌رییس کمیسیون تلفیق مجلس با اشاره به «فقیر شدن یک‌سوم مردم» گفت یافتن مقصر یا مقصران فشار معیشتی بر شهروندان «موضوع ثانویه» و «موج‌سواری رسانه‌ای» است.\n\nاو افزود: «افزایش جمعیت زیر خط فقر کشور به ۲۸ میلیون نفر، محدود به سیاست‌گذاری دو یا سه سال اخیر نیست.»\nhttps://iranintl.com/202308027316",
                "views": 8284
            },
            "186347": {
                "channel": "IranintlTV",
                "message": "تصویر رسیده به ایران اینترنشنال نشان می‌دهد افرادی روی سنگ مزار نسیم رحمانی‌فر، از کشته‌شدگان هواپیمای اوکراینی، در بهشت زهرا رنگ پاشیده‌اند.\n\nاینستاگرام انجمن خانواده جان‌باختگان پرواز اوکراینی نوشت عوامل جمهوری اسلامی برای پاشیدن گرد فراموشی بر جنایت خود این اقدام را کرده‌اند.\nhttps://iranintl.com/202308020430",
                "views": 6269
            },
            "186348": {
                "channel": "IranintlTV",
                "message": "پادکست رادیویی دیدگاه🎧\n\nشدت گرفتن بیماری فاطمه سپهری و محرومیت او از درمان\nگفت‌وگو با پوران ناظمی\n\nفاطمه سپهری،  مخالف شناخته‌شده رهبری علی خامنه‌ای و نظام جمهوری اسلامی از حق درمان محروم شده است. میهمان برنامه دیدگاه می‌گوید محرومیت سپهری از درمان ممکن است به فلج شدن او بینجامد.\nخانم سپهری که در خانواده‌ای مذهبی پرورش یافته و همسر شهید است، از معدود کسانی‌ست که پیش از خیزش مهسا مخالفتش با رهبری علی خامنه‌ای را آشکارا اعلام کرد و همین ایستادگی بر موضع بود که به رغم درد و بیماری شدید، او را از حق درمان و رسیدگی پزشکی محروم کرده.\nپوران ناظمی، فعال حقوق بشر از ایران، در برنامه دیدگاه از آخرین وضعیت خانم سپهری، شرایطش در زندان و همچنین از تاثیر او بر فضای اجتماعی و سیاسی ایران گفته است.\n@iranintltv",
                "views": 4207
            },
            "234691": {
                "channel": "irna_1313",
                "message": "#تکمیلی | حادثه آتش‌سوزی کارخانه «پتروپالایش» دورود تلفات جانی نداشت\n\n🔹حادثه آتش‌سوزی کارخانه «پتروپالایش» دورود تلفات جانی نداشت و تنها ۲ نفر از کارکنان آسیب دیدند که به صورت سطحی مداوا شدند.\n\n🔹در حال حاضر ۹۵ درصد حجم آتش‌سوزی کنترل شده است و تا ساعاتی دیگر به طور کامل مهار خواهد شد.\n\nلینک خبر\n@IRNA_1313",
                "views": 841
            },
            "234692": {
                "channel": "irna_1313",
                "message": "🎥 مشاهده خرس قهوه‌ای و دو توله خرس در شهرستان پاسارگاد استان فارس\n@IRNA_1313",
                "views": 808
            },
            "234693": {
                "channel": "irna_1313",
                "message": "شهادت مامور پلیس راه در شهرستان دنا\n\nمعاون سیاسی و امنیتی استانداری کهگیلویه و بویراحمد:\n🔹نیروی پلیس راه استان در حین انجام وظیفه در ایست و بازرسی در جاده یاسوج - اصفهان توسط یک خودروی شوتی زیرگرفته شد و به شهادت رسید.\n\n🔹سروان شهید «آراسته» پس از این حادثه به بیمارستان انتقال یافت اما متاسفانه به دلیل شدت جراحات در بیمارستان جان خود را از دست داد.\n\n🔹این حادثه ساعت حدود ۱۷ عصر امروز رخ داد و راننده متواری در تپه‌های اطراف جاده یاسوج-اصفهان دستگیر شد.\n@IRNA_1313",
                "views": 810
            },
            "234694": {
                "channel": "irna_1313",
                "message": "بازداشت زنی که به ائمه اطهار توهین کرده بود\n\nدادستان عمومی و انقلاب تهران:\n🔹زنی که به ائمه اطهار و مقدسات دینی توهین کرده بود با دستور قضایی و تلاش نیروهای مجاهد فراجا بازداشت شد.\n\n🔸در روزهای اخیر تصویری از یک خانم در مکان عمومی که به ائمه اطهار و مقدسات دینی توهین می‌کرد در فضای مجازی پخش شد.\n\nلینک خبر\n@IRNA_1313",
                "views": 583
            },
            "263437": {
                "channel": "Tasnimnews",
                "message": "خروج ۵ ثانیه‌ای زائران اربعین از مرزهای شش‌‌گانه\n\nمعاون فرهنگی و اجتماعی فراجا:\n🔹با تعامل انجام شده با پلیس عراق، مدت زمان خروج از گیت‌های کنترلی برای زائران اربعین به کمتر از ۵ ثانیه رسیده است.\n\n🔹داده‌های زائران اربعین در اختیار کشور عراق قرار گرفته تا آنان نیز در ورود زائران به کشور خود با مشکل مواجه نشوند و سرعت پذیرش زائران تسهیل شود.\n\n🔹زائران اربعین با ۵۰ هزار تومان و در کوتاه ترین زمان ممکن می‌توانند گذرنامه ۵ ساله دریافت کنند.\n\n#اربعین۱۴۰۲\ntn.ai/2935088\n@TasnimNews",
                "views": 5316
            },
            "263438": {
                "channel": "Tasnimnews",
                "message": "شاید این «نا»مرد یادش رفته باشد ولی ما یادمان می‌ماند \n\n🔹از اینکه این تصاویر را نشان می‌دهیم، عذرخواهی می‌کنیم. چیز قابل پخشی نیست؛ می‌دانیم ولی به ابزار تار کردن ویدئو رو زدیم تا جایی که می‌شود ما را در نشان دادن عمق تلخی این سانحه یاری دهد.  \n\n🔹حتما در جریان موضوع قرار گرفته‌اید. یک (مثلا) مرد یک خانم را در باغ نارنجستان قوام در شیراز به زمین می‌اندازد و به باد کتک می‌گیرد. در یک فضای عمومی، در مقابل مردم و پیش چشمان فرزند دختر این زن. \n\n🔹خانم محجبه آمر به معروف است و موضوع از تذکر برای رعایت پوشش حجاب در مجموعه شروع می‌شود و بقیه ماجرا. نمی‌خواهیم حالا که این آب روی زمین ریخته، همینطور الکی باد در غبغب بیاندازیم که «آقا حراست مجموعه کجا بوده» و «باید فوراً با متخلفان برخورد شود» و فلان و بهمان. مساله روشن است و قطعا از طریق قانونی پیگری می‌شود که انگار تا اینجا هم پیگیری و اعمال شده است. \n\n🔹باید به همین چند فریم از این مصیبتی که رخ داده، بدون عینک و حقیقتی‌تر نگاه کنیم. باید از نقطه‌ای قضاوت کنیم که همه زیر یک چتر مشترک قرار داریم. سطحی که شرف، غیرت‌ و وجدان متر اندازه‌گیری‌ است، نه سم‌پاشی رسانه‌ای و نفرت‌پراکنی بدخواهان ایران. \n\n🔹باید درنظر داشت که چه روندی از سوی چه کسانی و با چه مشوقانی و با چه نیت‌هایی پیش گرفته شده که کار را به اینجا رسانده تا یک زن از سوی یک «بی‌رگ» اینطور در روز روشن مورد حمله و بی‌حرمتی قرار می‌گیرد. \n\n🔹برهم زدن آرامش روانی مردم و نیت‌های خصمانه علیه ایران یک طرف؛ حالا نمایش رفتار غیرانسانی و رواج حیوان‌صفتی در میان است. \n\n🔹شاید این «نا»مرد -همین لات کوچه خلوت نارنجستان- یادش رفته باشد که اینجا ایران است، جایی که مردمانش برای ناموس، شرف، دین و امنیت جان داده‌اند و می‌دهند. \n\n🔹ما ولی قطعا یادنمان نمی‌رود پشت شعار‌های زیبای‌شان برای آزادی، چه کفتار دریده‌ای برای گرفتن جایگاه و امنیت زن و زندگی دندان تیز کرده است.\n@TasnimNews",
                "views": 4764
            },
            "263439": {
                "channel": "Tasnimnews",
                "message": "مهار آتش‌سوزی در پتروپالایش گهر پس از ۸ ساعت\n\n▪️یک میلیون و ۲۰۰ هزار لیتر مواد بنزینی سوخت  \n\nرئیس سازمان آتش‌نشانی ‌‌دورود:\n🔹‌آتش‌سوزی گسترده در شرکت پترو پالایش گهر پس از حدود هشت ساعت با تلاش نیروهای آتش‌نشانی، امدادی، اورژانس، هلال‌احمر و مدیریت بحران مهار شد.\n\n ‌🔹۱۸ تیم عملیاتی از برخی شهرهای لرستان و استان اراک برای اطفای حریق به این محل اعزام شدند.\n\n🔹یک میلیون و ۲۰۰ هزار لیتر مواد نفتا(بنزینی) در حریق شرکت پترو پالایش از بین رفت.\ntn.ai/2935112\n@TasnimNews",
                "views": 2654
            },
            "263440": {
                "channel": "Tasnimnews",
                "message": "شهادت مأمور پلیس در پا‌سگاه میمند\n\nفرمانده انتظامی شهرستان دنا:\n🔹‌سینا آراسته از ماموران پاسگاه انتظامی میمند شهرستان دنا حین ایست و بازرسی در جاده یاسوج ـ اصفهان توسط راننده شوتی زیر گرفته شد و به شهادت رسید.\n\n🔹‌راننده خودروی شوتی دستگیر شده است.\ntn.ai/2935110\n@TasnimNews",
                "views": 2554
            },
            "287428": {
                "channel": "farsna",
                "message": "زنِ توهین‌کننده به مقدسات بازداشت شد \n\n🔹در روزهای اخیر فیلمی منتشر شد که در آن یک زن در مکان عمومی به امام رضا و مقدسات دینی توهین می‌کرد. دادستان تهران گفته این خانم در زمان کوتاهی شناسایی و ساعتی پیش بازداشت شد.\n@Farsna - Link",
                "views": 11340
            },
            "287429": {
                "channel": "farsna",
                "message": "🎥 رئیس سازمان برنامه: طبق لایحۀ برنامۀ هفتم بستری بیماران تحت پوشش کمیته‌امداد و بهزیستی در بیمارستان‌های دولتی رایگان می‌شود\n\n🔹سهم پرداخت بیمۀ ۵ دهک اول هم ۲ درصد می‌شود. همچنین برای این دهک‌ها نوعی بیمۀ تکمیلیِ اختیاری طراحی می‌شود که هزینۀ درمانی‌شان به حداقل برسد.\n@Farsna",
                "views": 6180
            },
            "287430": {
                "channel": "farsna",
                "message": "حق اشتراکِ تلفن ثابت حذف شد\n\n🔹دیوان محاسبات: از سال ۹۸ مبلغی به‌اسم حق اشتراک در قبض‌های مشترکان لحاظ می‌شد اما با ابلاغ دیوان از خرداد این موضوع متوقف شد و بازگرداندن پول‌های دریافتی به مشترکان هم در دستورکار قرار داد. \n@Farsna - Link",
                "views": 4310
            },
            "287431": {
                "channel": "farsna",
                "message": "فرماندار جیرفتِ کرمان: قاچاقچی‌ای که با ریختن گازوییل در جاده باعث واژگونی خودروی پلیس و شهادت یک مامور شده بود، دستگیر شد.\n@Farsna - Link",
                "views": 2778
            }
        }

        let channel_name = []

        for (const key in allData) {
            if (!channel_name.includes(allData[key]['channel'])) {
                channel_name.push(allData[key]['channel'])
            }
        }

        return {
            rightDrawerOpen,
            toggleRightDrawer() {
                rightDrawerOpen.value = !rightDrawerOpen.value
            },
            channel_name,
            today
        }
    }
}
</script>
<style>
@font-face {
    font-family: "Vazir";
    src: url('../../public/fonts/Vazir.woff');
}
</style>