<template>
    <div class="q-pa-md row q-gutter-md" style="display: flex;justify-content: center;">
        <q-card style="width: 70%; min-width: 10rem;" v-for="(single_message, index) in all_messages" :key="single_message"
            flat bordered dir="rtl">
            <!-- <q-img src="https://cdn.quasar.dev/img/parallax2.jpg" /> -->
            <!-- <q-img :src="`../../media/${single_message.media_id}.jpg`" /> -->
            <q-img v-if="single_message.message_type == 'image'" :src="`${single_message.media_id}`" />
            <!-- <q-video v-else :ratio="16 / 9" src="../../media/shadmehr.mp4" /> -->
            <q-video v-else :ratio="16 / 9" src="" />
            <q-card-section>
                <div style="display: flex;justify-content: space-between;align-items: center;">
                    <div class="text-overline text-orange-9">{{ single_message.news_agency }}</div>
                    <div style="display: flex;">
                        {{ single_message.views }}
                        <q-icon class="q-mx-sm" name="img:../../public/icon/eyeVector.svg" />
                    </div>
                </div>
                <!-- <div class="text-h5 q-mt-sm q-mb-xs">{{ single_message.message_text }}</div> -->
                <div class="text-caption text-grey ellipsis-2-lines">
                    {{ single_message.message_text }}
                </div>
            </q-card-section>

            <q-card-actions>
                <q-btn color="grey" round flat dense :icon="expanded[index] ? 'keyboard_arrow_up' : 'keyboard_arrow_down'"
                    @click="toggle_expansion(index)" />
                <q-space />
                <q-btn flat color="primary" label="Share" />

            </q-card-actions>

            <q-slide-transition>
                <div v-show="expanded[index]">
                    <q-separator />
                    <q-card-section class="text-subitle2">
                        {{ single_message.message_text }}
                    </q-card-section>
                </div>
            </q-slide-transition>
        </q-card>
    </div>
</template>
  
<script>
import { ref } from 'vue'

export default {
    setup() {
        let expanded = ref([])
        //sample data
        const allData = {
            "68153": {
                "channel": "ManotoTV",
                "message": "صف طولانی بنزین در گرگان.",
                "views": 7578,
                "message_type": "video",
                "media_id": "2635916488625575895"
            },
            "68154": {
                "channel": "ManotoTV",
                "message": "موتورسواری با پوشش اختیاری.",
                "views": 5974,
                "message_type": "video",
                "media_id": "3635916488625575895"
            },
            "151618": {
                "channel": "mehrnews",
                "message": "📹 ۳ هزار شکایت علیه گران‌فروشی مونتاژکاران خودرو\n\n📡 @Mehrnews",
                "views": 197,
                "message_type": "video",
                "media_id": "8276283643798385895"
            },
            "151619": {
                "channel": "mehrnews",
                "message": "عمده تخلفات گروه رستمی صفا چه بوده است؟\n\n🔺 محمد رستمی صفا یک بدهکار کلان و دانه درشت بانکی بوده که از سال ۱۳۸۱ نسبت به تادیه بدهی‌های خود به دلایل نامعلومی خودداری کرده و با تبدیل مقداری از تسهیلات دریافتی به ارز، مبالغی را به خارج کشور منتقل کرده و اقدام به سرمایه‌گذاری کرده است.\n\n🔺 رستمی صفا با توسل به تهیه اسناد خلاف واقع نسبت به جذب تسهیلات ارزی کشور اقدام کرده و از طریق گشایش اعتبارات اسنادی و عدم انجام واردات کالا، ارقام قابل توجهی را از کشور خارج کرده است.\n\n🔺 رستمی صفا علاوه بر سرمایه‌گذاری عظیم در امارات متحده عربی بخشی از ثروت خود را در کشورهای آمریکا، انگلیس و سوئیس سرمایه‌گذاری کرده است.\n\n🔗 mehrnews.com/x32Sf3\n\n📡 @Mehrnews",
                "views": 38,
                "message_type": "image",
                "media_id": "0794169269385035895"
            },
            "188816": {
                "channel": "IranintlTV",
                "message": "🔻تیم فوتسال دختران دانشگاه تبریز، در رقابت های فستیوال بین المللی ورزش های دانشگاهی روسیه، با نتیجه ۷ بر ۲ کوبا را از پیش رو برداشت.\n\n🔹تیم‌های فوتسال پسران دانشگاه تهران، فوتسال دختران دانشگاه تبریز، تیم‌های بدمینتون دختران دانشگاه تهران، پسران دانشگاه فردوسی مشهد و تیم کشتی فرنگی دانشگاه فردوسی مشهد در این رقابت‌ها حضور دارند.\n\n@iranintltvsport",
                "views": 2104,
                "message_type": "video",
                "media_id": "4885573164195155895"
            },
            "188817": {
                "channel": "IranintlTV",
                "message": "🔻تیم ملی فوتبال زنان اسپانیا در فینال جام جهانی ۲۰۲۳ زنان در استرالیا با نتیجه یک بر صفر از سد تیم ملی انگلستان عبور کرد تا برای اولین بار در تاریخ به قهرمانی برسد.\n\n🔹اولگا کارمونا، ستاره ۲۳ ساله رئال مادرید و کاپیتان تیم ملی اسپانیا، تک گل این تیم را در دقیقه ۲۹ به ثمر رساند.\n\n@iranintltvsport",
                "views": 2099,
                "message_type": "image",
                "media_id": "5636573088689386895"
            },
            "237009": {
                "channel": "irna_1313",
                "message": "کاظمی قمی: کارشناسان ایرانی از ایستگاه آبسنجی دهراود افغانستان بازدید کردند / حقآبه ایران از هیرمند با عدالت اندازه‌گیری و تحویل شود\n\nنماینده ویژه رئیس جمهور در امور افغانستان:\n🔹پایبندی طرف  افغان و عمل به بخشی از مفاد معاهده سال ۱۳۵۱ ه.ش رودخانه هیرمند میان دولتین که منجر به بازدید تیم فنی جمهوری اسلامی ایران از ایستگاه آبسنجی دهراود که مبنای سنجش سال آبی نرمال است، نشانه مثبتی بر آغاز تعاملات سازنده در اعتماد سازی و حسن همجواری می‌باشد.\n\n🔹طبق نظر کارشناسان اعزامی که جریان آب در ایستگاه آبسنجی دهراود را مشاهده و اندازه گیری نموده‌اند، (میزان جریان آب در حال عبور در مرداد ماه  ۱۴۰۲) کمتر از میزان ماهانه یک سال آبی نرمال گزارش شده است.\n\n🔹انتظار می‌رود با استمرار در ارسال منظم ماهانه، اطلاعات و شاخص‌های آبسنجی، بازدیدهای بهنگام از این ایستگاه و تعیین دقیق میزان کم آبی و تر سالی هر سال، مقدار حقابه ایران از رودخانه هیرمند به درستی و با عدالت اندازه‌گیری و مطابق بند ب ماده ۳ معاهده به طرف ایرانی تحویل شود.\n@IRNA_1313",
                "views": 672,
                "message_type": "image",
                "media_id": "5359784830404335895"
            },
            "237011": {
                "channel": "irna_1313",
                "message": "🎥 هوش مصنوعی، نابودگر شغل‌ها؟\n\n🔹پیشرفت روزافزون هوش مصنوعی و قابلیت‌هایی که دارد، این نگرانی را برای برخی ایجاد کرده که آیا هوش مصنوعی مشاغل زیادی را از بین خواهد برد؟‌\n\n🔹اما در ارتباط با  هوش مصنوعی و مشاغل معمولاً فقط جنبه‌های منفی و نابودی شغل‌های مختلف دیده شده در حالی که پیش‌بینی‌های دقیق‌تر نشان می‌دهد در کنار پیشرفت هوش مصنوعی، موقعیت‌های شغلی جدیدی ایجاد خواهد شد.\n@IRNA_1313",
                "views": 463,
                "message_type": "video",
                "media_id": "2988368299304335895"
            },
            "265171": {
                "channel": "Tasnimnews",
                "message": "🔺فراخوان شرکت در نمایشگاه عرضه محصولات روستایی و عشایری\n\nنمایشگاه عرضه محصولات روستایی وعشایری کشور از تاریخ ۱۲ الی ۱۸ مهرماه در محل مصلی تهران برگزار می شود.\nاز صاحبان تولیدات روستایی دعوت می شود به منظور شرکت در این نمایشگاه  تا ۶ شهریور ماه به آدرس اینترنتی مراجعه کنند.\nWWW.IRDEXPO.IR\nمعاونت توسعه روستایی و مناطق محروم کشور",
                "views": 2374,
                "message_type": "image",
                "media_id": "4423212528006219045"
            },
            "265172": {
                "channel": "Tasnimnews",
                "message": "دیدار چهره به چهره اعضای دولت با مردم\n\nرئیس مرکز ارتباطات مردمی ریاست‌جمهوری:\n🔹به‌مناسبت هفته دولت دیدار چهره به چهره اعضای دولت با مردم در ۳۰ ‌مسجد استان تهران برگزار می‌شود. ۳۰ عضو کابینه متشکل از وزرا و معاونین رئیس‌جمهور پاسخگوی سوالات مردمی خواهند بود.\n\n🔹جمعه آینده حضور وزرا در نماز جمعه‌های سراسر کشور باهدف بیان دستاوردهای دولت و افتتاح پروژه‌های مهم انجام خواهد شد.\n@TasnimNews",
                "views": 1124,
                "message_type": "video",
                "media_id": "7476009883476455895"
            },
            "288841": {
                "channel": "farsna",
                "message": "برگزاریِ کنکور۱۴۰۳ در اردیبهشت و تیر\n\n🔹سازمان سنجش: کنکور سال آینده در دو نوبت ۶ و ۷ اردیبهشت و ۷ و ۸ تیر ۱۴۰۳ برگزار خواهد شد.\n\n🔹ثبت‌نام نوبت اول ۲۱ تا ۲۷ آبان ۱۴۰۲ و ثبت‌نام نوبت دوم ۷ تا ۱۲ فروردین ۱۴۰۳ انجام می‌گیرد.\n\n🔹آزمون کارشناسی ارشد ۱۴۰۳ در یک روز و ۴ اسفند ۱۴۰۲ برگزار می‌شود. ثبت‌نام این آزمون ۲۳ تا ۲۹ مهر ۱۴۰۲ انجام می‌گیرد.\n@Farsna - Link",
                "views": 2689,
                "message_type": "",
                "media_id": "2635916488625575895"
            },
            "288842": {
                "channel": "farsna",
                "message": "سفیر ایران در افغانستان: با وجود کم‌آبی‌ در افغانستان حقآبه ایران طبق معاهده باید پرداخت شود\n\n🔹طبق نظر کارشناسان اعزامی که جریان آب در ایستگاه آب‌سنجی دهراود را مشاهده و اندازه‌گیری کردند، میزان جریان آب در حال عبور در مرداد امسال کمتر از میزان ماهانۀ یک سال آبی عادی گزارش شده است.\n\n🔹باید ارسال منظم ماهانۀ اطلاعات و شاخص‌های آب‌سنجی، بازدیدهای به‌هنگام از این ایستگاه و تعیین دقیق میزان کم‌‌آبی و تر سالی هر سال ادامه پیدا کند و مقدار حقآبه ایران از رودخانۀ هیرمند به درستی و با عدالت اندازه‌گیری و مطابق معاهده تحویل شود.\n@Farsna - Link",
                "views": 1914,
                "message_type": "image",
                "media_id": "6820429378777845895"
            }
        }

        let all_images_list = ["7476009883476455895", "4423212528006219045", "0794169269385035895", "8276283643798385895", "2988368299304335895", "5359784830404335895", "6820429378777845895", "3635916488625575895", "2635916488625575895", "5636573088689386895", "4885573164195155895"]
        let all_messages = []

        for (const key in allData) {
            all_messages.push({
                news_agency: allData[key]['channel'],
                message_text: allData[key]['message'],
                views: allData[key]['views'],
                media_id: `../../media/${allData[key]['media_id']}.jpg`,
                message_type: allData[key]['message_type']
            })
            expanded.value.push(false)
        }

        function toggle_expansion(index) {
            expanded.value[index] = !expanded.value[index]
        }

        return {
            expanded,
            all_messages,
            toggle_expansion,
        }
    }
}
</script>
  